
///////////////////////////////////
// Flash Data Version
//  [ver]: [date]. [description] (programmer)
//  15 : Standard Version
//  16 : Russia Version
//  17 : 2008.09.04. GS Mart Version. Direct Ingredient 추가 (CJK)
//  18 : 2009.08.26. NH Mart(KOR) Version. 개체데이터 999개, 묶음 도축장 추가 (CJK)
//                   - 농협전용에만 추가됨 "/WorkBranch/V1.76.0_KOR(NHMart)"
//  21 : 2009.06.22. Chinese Font (goldman)
//  22 : 2010.11.18. Chinese Font & GS Mart PLU Struct For Chinese E-Mart. (CJK)
//  23 : 2012.03.07. Chinese Standart Market(표준화시장) Cart Scale (CJK)
//
// NVRAM Data Version
//  [ver]: [date]. [description] (programmer)
//  103 : Standard Version
//  113 : Russia Version
//  203 : Korea Meat Version. 개체번호 기억공간 사용 (CJK)
//
#if (ROM_COUNTRY == ROM_RUS)
#include "initial_russia.h"	//1.6
#elif defined(USE_CHN_CART_SCALE)
#include "initial_chn_cartscale.h"	//2.3
#elif (defined(USE_CHN_FONT) && defined(USE_GSMART_PLU))
#include "initial_chn_emart.h"	//2.2
#elif (defined(USE_GSMART_PLU) && defined(USE_KOR_TRACE_999))	// 농협
#include "initial_nhmart.h"		//1.8
#elif defined(USE_GSMART_PLU)
#include "initial_gsmart_plu.h"	//1.7
#elif defined(USE_CHN_FONT)
#include "initial_chn_font.h"	//2.1
#else
#include "initial_standard.h"	//1.5
#endif


#ifndef _FUNC_DISABLE
#define _FUNC_DISABLE
#define FUNC_CLERK		0x0001
#define FUNC_DISCOUNT	0x0002
#define FUNC_TAX_TBL	0x0004
#define FUNC_ORG_TBL	0x0008
#define FUNC_TARE_TBL	0x0010
#define FUNC_NUT_TBL	0x0020
#define FUNC_TRACE		0x0040

#define FONT_INFO_SIZE	6
#define FONT_IMAGE	78
#define FONT_MAX_SIZE	204800
#define FONT_MAX_NO     12
#endif

#ifndef _MEMORY_MAP_DEFINE_LABEL_STRUCT
#define _MEMORY_MAP_DEFINE_LABEL_STRUCT
#define LABEL_INFO_POINT	0
#define LABEL_INFO_SIZE		24   // 라벨 헤더 크기
#define LABEL_HEADER_SIZE	LABEL_INFO_SIZE 	// 라벨 헤더 크기
#define LABEL_IMAGE			480  // 라벨 헤더 전체 크기 (24 byte * 20 개)
#define LABEL_MAX_SIZE		4096 // 라벨 이미지 크기
#define LABEL_IMAGE_SIZE	LABEL_MAX_SIZE	// LABEL_MAX_SIZE 의미가 불분명하여 정의하였음

#define LABEL_CUSTOM_2MB_NUM			20 		// 기존 2MB 영역에서 사용자 정의 라벨 총 개수

// 라벨 확장 영역(4~8MB) 주소 계산을 위한 define
#ifdef USE_LABEL_FORMAT_EXT
  #define LABEL_CUSTOM_EXT_NUM		20  // ~ 8MB 확장 영역에서 사용자 정의 라벨 총 개수
  // 라벨 확장 영역(4~8MB) 주소 정의
  #define FLASH_LABEL_FORMAT_EXT_OFFSET			3431405 // 라벨 확장 영역 오프셋
#else
  #define LABEL_CUSTOM_EXT_NUM	 	0  // ~ 8MB 확장 영역에서 사용자 정의 라벨 총 개수
#endif /* USE_LABEL_FORMAT_EXT */

#define LABEL_CUSTOM_TOTAL_NUM \
	(LABEL_CUSTOM_2MB_NUM + LABEL_CUSTOM_EXT_NUM)	// 라벨 총 개수

#endif

//#ifndef _MEMORY_MAP_DEFINE_PRINT_STRUCT
//#define _MEMORY_MAP_DEFINE_PRINT_STRUCT
//#define PRT_FONT_MENUID	251
//#define PRT_FONT_PLUID	252
//#define PRT_FONT_LABELID	253
// #define PRT_LABEL_DEFAULTID	254
//#endif

#ifndef _MEMORY_MAP_DEFINE_BITMAP_STRUCT
#define _MEMORY_MAP_DEFINE_BITMAP_STRUCT
#define BITMAP_INFO_POINT	0
#define BITMAP_INFO_SIZE	6
#define BITMAP_IMAGE	84
#define BITMAP_MAX_SIZE	8192
#endif

#ifndef _MEMORY_MAP_DEFINE_NETWORK_STRUCT
#define _MEMORY_MAP_DEFINE_NETWORK_STRUCT
#define NETWORK_GLOBAL_TYPE	0
#define NETWORK_SERVICE_TYPE	1
#define NETWORK_SCALE_ID	2
#define NETWORK_SCALE_NAME	4
#define NETWORK_MAX_CONNECTION	24
#define NETWORK_DEPARTMENT_ID	26
#define NETWORK_CLERK_ID	28
#define NETWORK_CLERK_CHANGEOPTION	30
#define NETWORK_SERVICE_FLAG	32
#define NETWORK_STORE_ID	34
#define NETWORK_LOCAL_IP	36
#define NETWORK_LOCAL_GATEWAY	40
#define NETWORK_LOCAL_SUBNETMASK	44
#define NETWORK_LOCAL_ETHERNET_FLAG	48
#define NETWORK_LOCAL_TCP_PORT	50
#define NETWORK_LOCAL_UDP_PORT	52
#define NETWORK_MACHINE_LIST_POINT	54
#define NETWORK_MACHINE_REMOTE_IP	56
#define NETWORK_MACHINE_REMOTE_TCPPORT	60
#define NETWORK_MACHINE_REMOTE_UDPPORT	62
#define NETWORK_MACHINE_REMOTE_STATUS	64
#define NETWORK_WLAN_SSID	66
#define NETWORK_WLAN_WEP	100
#define NETWORK_WLAN_WEPID	164
#define NETWORK_WLAN_USEWEP	165
#define NETWORK_WLAN_ETC	166
#define NETWORK_SERVICE_FLAG2	175
#define NETWORK_DIVISION_ID	176		//-[2006.03.06 bmlim 분류번호
#define NETWORK_SERVICE_FLAG3	178	//SG061228. Backup to scale commun method
#define NETWORK_RESERVED	179

#endif

#ifndef _MEMORY_MAP_DEFINE_DNS_STRUCT
#define _MEMORY_MAP_DEFINE_DNS_STRUCT
#define NETWORK_REMOTE_URL		80
#define NETWORK_REMOTE_URL_MAX_SIZE		60
#define NETWORK_DNS_IP			(NETWORK_REMOTE_URL + NETWORK_REMOTE_URL_MAX_SIZE)
#define NETWORK_DNS_IP_SIZE		4
#define NETWORK_DNS_PORT		(NETWORK_DNS_IP + NETWORK_DNS_IP_SIZE)
#define NETWORK_DNS_PORT_SIZE	2
#endif

#ifndef __STARTUP_STRUCTURE
#define __STARTUP_STRUCTURE
#pragma pack(4)
typedef struct {
	INT8U   version[2];
////	INT8U   fwversion[3];
	INT16U	start_flag;
	INT8U	global_com;
	INT32U	start_addr;
	INT8U	slot_adc;
	INT32U	addr_adc;
	INT16U  number_scale;
	INT8U   menu_type;
	INT8U   scale_type;
	INT8U   line_max;
	INT16U  country;
	INT16S     menu_xgap,menu_ygap;
	INT16S     menu_length;
	INT8U   disable_dept;
	INT16U  scroll_timeout;
	INT8U   ethernet_notready;
	INT32U	addr_send_buf;
	INT32U	addr_paysend_buf;
	INT16U	max_send_buf;
	INT16U	max_paysend_buf;
	INT16U	max_realsend_buf;
	INT8U	use_ext_nvram;
	INT8U   wireless_type;
	INT8U   wireless_model;
} STARTUP_CONFIG;
#pragma pack()
#endif

#ifndef __CTS_STRUCTURE
#define __CTS_STRUCTURE
typedef struct {
	INT8U  CtsEnable;    // 0
	INT8U  CtsVersion;    // 1
	INT8U  SerialNo[16]; // 2~17
	INT8U  Initialized;  // 18 // CTS 초기화 유무 판단
	INT8U  CtsExpired;  // 19
	INT16U  CtsPeriod;  // 20
	INT8U  CtsCalYear;	// 22
	INT8U  CtsCalMonth;	// 23
	INT8U  CtsCalDate;	// 24
	INT8U  reserve[5];	// 25~29
	INT16U crc16;		// 30
} CTS_STRUCT;
typedef struct {
	INT8U  ProductCode[16];		// 0
	INT32U EncryptKey1;			// 16
	INT32U BoardId;				// 20
	INT8U  reserve[2];			// 24~25
	INT16U crc16;				// 26
} CTS_STRUCT2;	// History 영역 30바이트 중 pack(4)의 영향 고려하여 28바이트만 할당
typedef struct {
	INT32U zero;
	INT32U span;
	INT32U time;
	INT32U midup;
	INT32U middn;
} CTS_ENCRYPT_BUF_STRUCT;
// 기존에 cal history 기능에서 저장된 날짜 기준이었던 것을, CAL Comp 시 저장된 날짜를 기준으로 판단하도록 변경하여 구조체에 CAL date 추가
// CAL Password에서 사용하던 공간 통합
#define CTS_STRUCT_SIZE  sizeof(CTS_STRUCT)
#define CTS_STRUCT_SIZE2  sizeof(CTS_STRUCT2)
#define CTS_INIT_COMPLETED 0x83
//#define CTS_INIT_COMPLETED 0x8B	// Version 2 테스트롬을 베트남 지사에 테스트롬 보내기 직전 버전 2를 버전 1으로 돌렸다 다시 버전2로 업할 경우 생기는 버그 때문에 임시로 플래그를 변경. 버그 수정 후 원래대로 수정할 예정 20180402 KSY
//#define CTS_VERSION 	0x01	// 생산 적용 시 최초 적용
#define CTS_VERSION 	0x02	// CTS Struct2(ProductCode) 추가, BoardId, 암호화키 추가

#endif

#ifndef __FONT_ID_DEFINE
#define __FONT_ID_DEFINE
extern INT8U DSP_MENU_FONT_ID;
extern INT8U DSP_PLU_FONT_ID;
extern INT8U PRT_DEFAULT_FONT_ID;
#endif

//#define MAX_PLU_NO			1000	// INPUT NO Reference
extern INT32U  MAX_PLU_NO,MAX_PLU_large,MAX_PLU_small;
